------------------------------------------------
--- 文件自动生成
---
--- 根据error.xml生成
---
--- 请勿手动修改
------------------------------------------------

cc.exports.error_msg_const = {
    ["1"] = "注册失败",
    ["2"] = "登陆密码错误",
    ["3"] = "验证错误",
    ["4"] = "登陆超时",
    ["5"] = "您的账号在其他地方登陆",
    ["6"] = "没有可用的用户数据网关节点",
    ["7"] = "数据库访问超时",
    ["8"] = "没有此账号",
    ["9"] = "账号密码错误",
    ["10"] = "数据库错误，请联系gm",
    ["11"] = "账号已存在",
    ["12"] = "登陆异常，请稍后尝试",
    ["13"] = "请稍后",
    ["14"] = "服务暂时关闭",
    ["15"] = "先登录服务",
    ["16"] = "场景登录服务异常,请重试",
    ["17"] = "事件已消失",
    ["18"] = "不在事件范围内",
    ["19"] = "事件已接",
    ["20"] = "事件正在接受中，请稍后",
    ["21"] = "事件接取失败，人数已满",
    ["22"] = "道具不存在，合成失败",
    ["23"] = "材料不足，合成失败",
    ["24"] = "类型错误，不是图纸",
    ["25"] = "事件已结束",
    ["26"] = "异常错误，请联系GM",
    ["27"] = "宠物已派遣",
    ["28"] = "派遣的不是日常事件，参数错误",
    ["29"] = "派遣的是日常事件，参数错误",
    ["30"] = "对应宠物缺少速度属性，派遣失败！",
    ["31"] = "宠物位置参数错误",
    ["32"] = "聊天cd中...",
    ["33"] = "聊天服务器异常，请稍后在做尝试...",
    ["34"] = "道具不存在，使用失败",
    ["35"] = "道具模板类型错误，使用失败",
    ["36"] = "已有该配方，使用失败",
    ["37"] = "缺少配方，合成失败",
    ["38"] = "异常错误，请联系GM",
    ["39"] = "异常错误，请联系GM",
    ["40"] = "异常错误，请联系GM",
    ["41"] = "异常错误，请联系GM",
    ["42"] = "异常错误，请联系GM",
    ["43"] = "异常错误，请联系GM",
    ["44"] = "异常错误，请联系GM",
    ["45"] = "事件参与人数达到上线，参与失败！",
    ["46"] = "事件参与次数已用尽，参与失败！",
}

